---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.CannotRemoveGroupMemberConstraintWarn
source: html/ca8b901d-06ab-0ca9-3eec-7ef0c94b4c7b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.CannotRemoveGroupMemberConstraintWarn Property

Constraints between group members cannot be removed or excluded from the group.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotRemoveGroupMemberConstraintWarn { get; }
```